; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	spectrograph1 - mode
	spectrograph0 - mode
	infrared2 - mode
	GroundStation0 - direction
	Star4 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation1 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Star18 - direction
	Star19 - direction
	Planet20 - direction
	Star21 - direction
	Star22 - direction
	Phenomenon23 - direction
	Planet24 - direction
	Phenomenon25 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star18)
	(supports instrument3 spectrograph1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet6)
	(supports instrument4 infrared2)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star4)
	(supports instrument5 spectrograph1)
	(supports instrument5 spectrograph0)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star4)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star19)
	(supports instrument7 spectrograph0)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star2)
	(supports instrument8 infrared2)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet15)
)
(:goal (and
	(pointing satellite2 Star11)
	(pointing satellite3 Star8)
	(have_image Planet5 infrared2)
	(have_image Planet6 spectrograph0)
	(have_image Planet7 infrared2)
	(have_image Star8 spectrograph0)
	(have_image Phenomenon9 infrared2)
	(have_image Star10 spectrograph1)
	(have_image Star11 spectrograph0)
	(have_image Phenomenon12 spectrograph0)
	(have_image Star13 spectrograph0)
	(have_image Planet14 spectrograph1)
	(have_image Planet15 spectrograph1)
	(have_image Star17 spectrograph0)
	(have_image Star18 infrared2)
	(have_image Star19 infrared2)
	(have_image Planet20 infrared2)
	(have_image Star21 infrared2)
	(have_image Star22 spectrograph0)
	(have_image Phenomenon23 infrared2)
	(have_image Phenomenon25 spectrograph0)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 21
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 21
3. (turn_to satellite4 phenomenon12 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 phenomenon12)
   goals met: 0 of 21
4. (turn_to satellite4 star2 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 star2)
   goals met: 0 of 21
5. (calibrate satellite4 instrument7 star2)
   added: (calibrated instrument7)
   goals met: 0 of 21
6. (turn_to satellite4 phenomenon12 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon12)
   goals met: 0 of 21
7. (take_image satellite4 phenomenon12 instrument7 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 1 of 21
8. (turn_to satellite4 phenomenon23 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon23)
   goals met: 1 of 21
9. (take_image satellite4 phenomenon23 instrument7 infrared2)
   added: (have_image phenomenon23 infrared2)
   goals met: 2 of 21
10. (turn_to satellite4 phenomenon25 phenomenon23)
   deleted: (pointing satellite4 phenomenon23)
   added: (pointing satellite4 phenomenon25)
   goals met: 2 of 21
11. (take_image satellite4 phenomenon25 instrument7 spectrograph0)
   added: (have_image phenomenon25 spectrograph0)
   goals met: 3 of 21
12. (turn_to satellite4 phenomenon9 phenomenon25)
   deleted: (pointing satellite4 phenomenon25)
   added: (pointing satellite4 phenomenon9)
   goals met: 3 of 21
13. (take_image satellite4 phenomenon9 instrument7 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 4 of 21
14. (turn_to satellite4 planet20 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet20)
   goals met: 4 of 21
15. (take_image satellite4 planet20 instrument7 infrared2)
   added: (have_image planet20 infrared2)
   goals met: 5 of 21
16. (turn_to satellite4 planet5 planet20)
   deleted: (pointing satellite4 planet20)
   added: (pointing satellite4 planet5)
   goals met: 5 of 21
17. (take_image satellite4 planet5 instrument7 infrared2)
   added: (have_image planet5 infrared2)
   goals met: 6 of 21
18. (turn_to satellite4 planet6 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 planet6)
   goals met: 6 of 21
19. (take_image satellite4 planet6 instrument7 spectrograph0)
   added: (have_image planet6 spectrograph0)
   goals met: 7 of 21
20. (turn_to satellite4 planet7 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 planet7)
   goals met: 7 of 21
21. (take_image satellite4 planet7 instrument7 infrared2)
   added: (have_image planet7 infrared2)
   goals met: 8 of 21
22. (turn_to satellite4 star11 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 star11)
   goals met: 8 of 21
23. (take_image satellite4 star11 instrument7 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 9 of 21
24. (turn_to satellite4 star13 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 star13)
   goals met: 9 of 21
25. (take_image satellite4 star13 instrument7 spectrograph0)
   added: (have_image star13 spectrograph0)
   goals met: 10 of 21
26. (turn_to satellite4 star17 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 star17)
   goals met: 10 of 21
27. (take_image satellite4 star17 instrument7 spectrograph0)
   added: (have_image star17 spectrograph0)
   goals met: 11 of 21
28. (turn_to satellite4 star18 star17)
   deleted: (pointing satellite4 star17)
   added: (pointing satellite4 star18)
   goals met: 11 of 21
29. (take_image satellite4 star18 instrument7 infrared2)
   added: (have_image star18 infrared2)
   goals met: 12 of 21
30. (turn_to satellite4 star19 star18)
   deleted: (pointing satellite4 star18)
   added: (pointing satellite4 star19)
   goals met: 12 of 21
31. (take_image satellite4 star19 instrument7 infrared2)
   added: (have_image star19 infrared2)
   goals met: 13 of 21
32. (turn_to satellite4 star21 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 star21)
   goals met: 13 of 21
33. (take_image satellite4 star21 instrument7 infrared2)
   added: (have_image star21 infrared2)
   goals met: 14 of 21
34. (turn_to satellite4 star22 star21)
   deleted: (pointing satellite4 star21)
   added: (pointing satellite4 star22)
   goals met: 14 of 21
35. (take_image satellite4 star22 instrument7 spectrograph0)
   added: (have_image star22 spectrograph0)
   goals met: 15 of 21
36. (turn_to satellite4 star8 star22)
   deleted: (pointing satellite4 star22)
   added: (pointing satellite4 star8)
   goals met: 15 of 21
37. (take_image satellite4 star8 instrument7 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 16 of 21
38. (turn_to satellite3 star8 star19)
   deleted: (pointing satellite3 star19)
   added: (pointing satellite3 star8)
   goals met: 17 of 21
39. (turn_to satellite2 star11 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star11)
   goals met: 18 of 21
40. (turn_to satellite0 star2 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star2)
   goals met: 18 of 21
41. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 18 of 21
42. (turn_to satellite0 planet14 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet14)
   goals met: 18 of 21
43. (take_image satellite0 planet14 instrument1 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 19 of 21
44. (turn_to satellite0 planet15 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet15)
   goals met: 19 of 21
45. (take_image satellite0 planet15 instrument1 spectrograph1)
   added: (have_image planet15 spectrograph1)
   goals met: 20 of 21
46. (turn_to satellite0 star10 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star10)
   goals met: 20 of 21
47. (take_image satellite0 star10 instrument1 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 21 of 21
